code/rails_projects/alpha-blog/app/controllers/categories_controller.rb

 def index
  @categories = Category.paginate(page: params[:page], per_page: 5)
---
SELECT  "categories".* FROM "categories" LIMIT 5 OFFSET 0

  def create
  @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sports"], ["created_at", "2016-02-20 17:41:56.477176"], ["updated_at", "2016-02-20 17:41:56.477176"]]